In [3]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range("20130101", periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))

In [17]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["test", "train","test", "train"]),
        "F": "foo",
    }
)

In [20]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [22]:
df.head()

                   A         B         C         D
2013-01-01 -1.069837 -0.089332  0.881143  1.414471
2013-01-02 -0.074109  1.786336  0.741274  0.220150
2013-01-03  0.767098 -1.119848  0.691682  1.190934
2013-01-04 -0.484438  0.074717  2.229112  0.648480
2013-01-05  0.393283  0.556616  1.075938 -2.099899

In [23]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.484438  0.074717  2.229112  0.648480
2013-01-05  0.393283  0.556616  1.075938 -2.099899
2013-01-06 -0.597529 -0.786346  1.003915 -2.324841

In [24]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [26]:
df.to_numpy()

array([[-1.06983714, -0.08933239,  0.88114264,  1.41447126],
       [-0.0741095 ,  1.78633628,  0.74127369,  0.22015029],
       [ 0.76709822, -1.11984763,  0.69168202,  1.19093373],
       [-0.48443838,  0.07471676,  2.22911226,  0.64848032],
       [ 0.39328342,  0.55661606,  1.07593803, -2.09989879],
       [-0.59752887, -0.786346  ,  1.00391523, -2.32484121]])

In [27]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [28]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [29]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.177589  0.070357  1.103844 -0.158451
std    0.677591  1.035092  0.570600  1.646321
min   -1.069837 -1.119848  0.691682 -2.324841
25%   -0.569256 -0.612093  0.776241 -1.519887
50%   -0.279274 -0.007308  0.942529  0.434315
75%    0.276435  0.436141  1.057932  1.055320
max    0.767098  1.786336  2.229112  1.414471

In [30]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.069837   -0.074109    0.767098   -0.484438    0.393283   -0.597529
B   -0.089332    1.786336   -1.119848    0.074717    0.556616   -0.786346
C    0.881143    0.741274    0.691682    2.229112    1.075938    1.003915
D    1.414471    0.220150    1.190934    0.648480   -2.099899   -2.324841

In [31]:
df.sort_index()

                   A         B         C         D
2013-01-01 -1.069837 -0.089332  0.881143  1.414471
2013-01-02 -0.074109  1.786336  0.741274  0.220150
2013-01-03  0.767098 -1.119848  0.691682  1.190934
2013-01-04 -0.484438  0.074717  2.229112  0.648480
2013-01-05  0.393283  0.556616  1.075938 -2.099899
2013-01-06 -0.597529 -0.786346  1.003915 -2.324841

In [32]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.414471  0.881143 -0.089332 -1.069837
2013-01-02  0.220150  0.741274  1.786336 -0.074109
2013-01-03  1.190934  0.691682 -1.119848  0.767098
2013-01-04  0.648480  2.229112  0.074717 -0.484438
2013-01-05 -2.099899  1.075938  0.556616  0.393283
2013-01-06 -2.324841  1.003915 -0.786346 -0.597529

In [33]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-03  0.767098 -1.119848  0.691682  1.190934
2013-01-06 -0.597529 -0.786346  1.003915 -2.324841
2013-01-01 -1.069837 -0.089332  0.881143  1.414471
2013-01-04 -0.484438  0.074717  2.229112  0.648480
2013-01-05  0.393283  0.556616  1.075938 -2.099899
2013-01-02 -0.074109  1.786336  0.741274  0.220150

In [34]:
df["A"]

2013-01-01   -1.069837
2013-01-02   -0.074109
2013-01-03    0.767098
2013-01-04   -0.484438
2013-01-05    0.393283
2013-01-06   -0.597529
Freq: D, Name: A, dtype: float64

In [35]:
df.A

2013-01-01   -1.069837
2013-01-02   -0.074109
2013-01-03    0.767098
2013-01-04   -0.484438
2013-01-05    0.393283
2013-01-06   -0.597529
Freq: D, Name: A, dtype: float64

In [36]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.069837 -0.089332  0.881143  1.414471
2013-01-02 -0.074109  1.786336  0.741274  0.220150
2013-01-03  0.767098 -1.119848  0.691682  1.190934

In [37]:
df.loc[dates[0]]

A   -1.069837
B   -0.089332
C    0.881143
D    1.414471
Name: 2013-01-01 00:00:00, dtype: float64

In [38]:
dates[0]

Timestamp('2013-01-01 00:00:00')

In [41]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -1.069837 -0.089332
2013-01-02 -0.074109  1.786336
2013-01-03  0.767098 -1.119848
2013-01-04 -0.484438  0.074717
2013-01-05  0.393283  0.556616
2013-01-06 -0.597529 -0.786346

In [42]:
df.loc[dates[0],"A"]

np.float64(-1.0698371375586577)

In [43]:
df.at[dates[0],"A"]

np.float64(-1.0698371375586577)

In [45]:
df.iloc[3]

A   -0.484438
B    0.074717
C    2.229112
D    0.648480
Name: 2013-01-04 00:00:00, dtype: float64

In [48]:
df.iloc[:,1]

2013-01-01   -0.089332
2013-01-02    1.786336
2013-01-03   -1.119848
2013-01-04    0.074717
2013-01-05    0.556616
2013-01-06   -0.786346
Freq: D, Name: B, dtype: float64

In [49]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-03  0.767098 -1.119848  0.691682  1.190934
2013-01-05  0.393283  0.556616  1.075938 -2.099899

In [57]:
df["A"] > 0

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [50]:
df2 = df.copy()

In [53]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [54]:
df2

                   A         B         C         D      E
2013-01-01 -1.069837 -0.089332  0.881143  1.414471    one
2013-01-02 -0.074109  1.786336  0.741274  0.220150    one
2013-01-03  0.767098 -1.119848  0.691682  1.190934    two
2013-01-04 -0.484438  0.074717  2.229112  0.648480  three
2013-01-05  0.393283  0.556616  1.075938 -2.099899   four
2013-01-06 -0.597529 -0.786346  1.003915 -2.324841  three

In [55]:
df2[df2["E"].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03  0.767098 -1.119848  0.691682  1.190934   two
2013-01-05  0.393283  0.556616  1.075938 -2.099899  four

In [56]:
df2["E"].isin(["two","four"])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [58]:
s1 = pd.Series([1,2,3,4,5,6], index = pd.date_range("20130102", periods=6))

In [59]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [60]:
df.iat[0,1] = 0

In [69]:
np.array(5 * len(df))

array(30)

In [71]:
df2 = df.copy()

In [76]:
df2[df2 > 0] = -df2

In [77]:
df2

                   A         B         C         D
2013-01-01 -1.069837  0.000000 -0.881143 -1.414471
2013-01-02 -0.074109 -1.786336 -0.741274 -0.220150
2013-01-03 -0.767098 -1.119848 -0.691682 -1.190934
2013-01-04 -0.484438 -0.074717 -2.229112 -0.648480
2013-01-05 -0.393283 -0.556616 -1.075938 -2.099899
2013-01-06 -0.597529 -0.786346 -1.003915 -2.324841